Revit 2027 API
IFCAnyHandle.SetAttribute(String, Int32) Method
 Sets the attribute value.
Namespace: Autodesk.Revit.DB.IFC
Assembly: RevitAPIIFC (in RevitAPIIFC.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void SetAttribute(
	string name,
	int value
)
Public Sub SetAttribute (
	name As String,
	value As Integer
)
public:
void SetAttribute(
	String^ name,
	int value
)
member SetAttribute :
        name : string *
        value : int -> unit
Parameters
name String
 The attribute name.
value Int32
 The value.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
IFCAnyHandle Class
SetAttribute Overload
Autodesk.Revit.DB.IFC Namespace